year = 78
a = input("Здравствуйте! Как вас зовут?")
print("Очень приятно,", a + "! Меня зовут Марк.")
x = int(input("Сколько вам лет?"))
if year > x:
    print(f'Да, {a}, я старше Вас на {year - x} лет.')
else:
    print(f'Да, {a}, Вы старше меня н {x - year} лет.')
c = input("Вам нравится программировать?")
if c == "Нет" or "нет":
    print("Жаль. Я думал, Вы сможете написать интересную программу для меня.")
elif c == "Да" or c == "да":
    print("Превосходно! Уверен, у Вас получится написать множество полезных и хороших программ.")